OFtutorialTest04_MRF/turbine/debug_case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 20;

boundaryField
{
    INFLOW
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           uniform 200;
    }
    OUTFLOW
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
    
    BLADE
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    HUB
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }
    
    SHROUD
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }
    
    PER1
    {
        type            cyclicAMI;
    }
    
    PER2
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //
